{"config": [{"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "name": "conv2d_1", "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 150, 150, 3], "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "name": "conv2d_2", "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "name": "conv2d_3", "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 64, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "units": 1, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_5"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4"}